tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "bat"
brew "curl"
brew "dos2unix"
brew "fd"
brew "htop"
brew "ncdu"
brew "neovim"
brew "openjdk"
brew "progress"
brew "pstree"
brew "smartmontools"
brew "stow"
brew "telnet"
brew "tmux"
brew "topgrade"
brew "tree"
brew "zsh"

cask "aldente"
cask "iterm2"
cask "monitorcontrol"
cask "obs"

cask "freecad"
cask "kicad"
cask "openscad"

cask "3dgenceslicer"
cask "ankerslicer"
cask "creality-slicer"
cask "dremel-slicer"
cask "flashforge-flashprint"
cask "ideamaker"
cask "lycheeslicer"
cask "prusaslicer"
cask "slic3r"
cask "snapmaker-luban"
cask "superslicer"
