tap "1password/tap"
tap "dart-lang/dart"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kak-lsp/kak-lsp"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git", force_auto_update: true
tap "mcjack123/craftospc"
tap "natesales/repo", "https://github.com/natesales/repo.git"
tap "pixelcmtd/extra"

brew "pixelcmtd/extra/x265", head: true
brew "ant"
brew "argon2"
brew "asciidoctor"
brew "aspell"
brew "astyle"
brew "autoconf"
brew "automake"
brew "bat"
brew "bdw-gc"
brew "bear"
brew "binaryen"
brew "binutils"
brew "binwalk"
brew "boost"
brew "btpd"
brew "c"
brew "c-ares"
brew "cairo"
brew "capstone"
brew "ccache"
brew "check"
brew "chocolate-doom"
brew "clisp"
brew "cloc"
brew "clojure"
brew "cmake"
brew "cmatrix"
brew "cmocka"
brew "coreutils"
brew "cowsay"
brew "crispy-doom"
brew "ctags"
brew "curl"
brew "cvs"
brew "cvs-fast-export"
brew "darcs"
brew "dart-lang/dart/dart"
brew "dav1d"
brew "dbus"
brew "deno"
brew "difftastic"
brew "dockutil"
brew "dos2unix"
brew "double-conversion"
brew "doxygen"
brew "dub"
brew "dust"
brew "emscripten"
brew "erlang"
brew "extra-cmake-modules"
brew "fd"
brew "fetch"
brew "fetchmail"
brew "figlet"
brew "findutils"
brew "fish"
brew "flatbuffers"
brew "fontconfig"
brew "fossil"
brew "fping"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "git-bug"
brew "git-cola"
brew "git-extras"
brew "git-lfs"
brew "gitlint"
brew "glances"
brew "glew"
brew "glib"
brew "gmp"
brew "gnu-barcode"
brew "gnu-chess"
brew "gnu-complexity"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-prolog"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnuradio"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "gocr"
brew "goreleaser"
brew "gperftools"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "guile"
brew "harfbuzz"
brew "haxe"
brew "hcloud"
brew "htop"
brew "httping"
brew "icdiff"
brew "ice"
brew "icu4c"
brew "ifstat"
brew "imagemagick"
brew "imath"
brew "ios-deploy"
brew "ipython"
brew "isl"
brew "ispell"
brew "jansson"
brew "jasper"
brew "jemalloc"
brew "jq"
brew "json-c"
brew "kak-lsp/kak-lsp/kak-lsp"
brew "kakoune"
brew "kotlin"
brew "lame"
brew "lcov"
brew "leiningen"
brew "leptonica"
brew "libplist"
brew "little-cms2"
brew "llvm"
brew "lmdb"
brew "lsd"
brew "lua"
brew "luajit-openresty"
brew "luarocks"
brew "lynx"
brew "make"
brew "markdown"
brew "mas"
brew "masscan"
brew "maven"
brew "mcpp"
brew "mercurial"
brew "meson"
brew "minicom"
brew "mitmproxy"
brew "mle"
brew "moar"
brew "molten-vk"
brew "moreutils"
brew "msgpack"
brew "mtr"
brew "mu"
brew "mupdf"
brew "nasm"
brew "ncdu"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nim"
brew "ninja"
brew "nmap"
brew "node"
brew "npth"
brew "nspr"
brew "nss"
brew "ocaml"
brew "octave"
brew "offlineimap"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openssl"
brew "p11-kit"
brew "p7zip"
brew "pam_yubico"
brew "pandoc"
brew "pcsc-lite"
brew "perl"
brew "pfetch"
brew "php"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "podman"
brew "ponyc"
brew "poppler"
brew "portaudio"
brew "progress"
brew "protobuf"
brew "pstree"
brew "pv"
brew "python"
brew "q"
brew "qemu"
brew "qrencode"
brew "qt"
brew "qt@5"
brew "radare2"
brew "ranger"
brew "rav1e"
brew "readline"
brew "renameutils"
brew "ripgrep"
brew "rlwrap"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "rustup-init"
brew "s-lang"
brew "sbcl"
brew "screenfetch"
brew "screenresolution"
brew "shared-mime-info"
brew "shc"
brew "shellcheck"
brew "six"
brew "sl"
brew "smartmontools"
brew "snappy"
brew "socat"
brew "source-highlight"
brew "stack"
brew "stow"
brew "stress-ng"
brew "swift"
brew "swiftformat"
brew "swig"
brew "talloc"
brew "tcl-tk"
brew "telnet"
brew "tesseract"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "topgrade"
brew "tor"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "v8"
brew "vala"
brew "vbindiff"
brew "vde"
brew "vifm"
brew "vitetris"
brew "vulkan-headers"
brew "vulkan-loader"
brew "w3m"
brew "wabt"
brew "wasmer"
brew "watch"
brew "webp"
brew "wget"
brew "winetricks"
brew "xapian"
brew "xcodegen"
brew "xmlto"
brew "xorgproto"
brew "xsane"
brew "xz"
brew "yarn"
brew "yash"
brew "ykclient"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "yubico-piv-tool"
brew "zig"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zstd"

brew "pixelcmtd/extra/ffmpeg", args: ["with-aribb24", "with-fdk-aac", "with-game-music-emu", "with-jack", "with-libaribb24", "with-libbluray", "with-libbs2b", "with-libcaca", "with-libgsm", "with-libmodplug", "with-libopenmpt", "with-librist", "with-librsvg", "with-libsoxr", "with-libssh", "with-libvidstab", "with-libvmaf", "with-libxml2", "with-opencore-amr", "with-openh264", "with-openjpeg", "with-openssl", "with-rav1e", "with-rtmpdump", "with-rubberband", "with-speex", "with-srt", "with-svt-av1", "with-tesseract", "with-two-lame", "with-webp", "with-xvid", "with-zeromq", "with-zimg"]

brew "kde-mac/kde/atcore"
brew "kde-mac/kde/kcalc"
brew "kde-mac/kde/kdiagram"
brew "kde-mac/kde/kdialog"
brew "kde-mac/kde/kdiff3"
brew "kde-mac/kde/kimap"
brew "kde-mac/kde/kio-extras"
brew "kde-mac/kde/kmime"
brew "kde-mac/kde/kolourpaint"
brew "kde-mac/kde/konsole"
brew "kde-mac/kde/konversation"
brew "kde-mac/kde/krename"
brew "kde-mac/kde/krusader"
brew "kde-mac/kde/ksysguard"
brew "kde-mac/kde/libalkimia"
brew "kde-mac/kde/libkexiv2"
brew "kde-mac/kde/libkomparediff2"
brew "kde-mac/kde/libksysguard"
brew "kde-mac/kde/lokalize"
brew "kde-mac/kde/phonon"
brew "kde-mac/kde/poxml"
cask "kde-mac/kde/kdeconnect"

cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "altserver"
cask "arduino-ide"
cask "audacity"
cask "balenaetcher"
cask "mactex"
cask "mpv"
cask "blackhole-2ch"
cask "blender"
cask "brave-browser"
cask "burp-suite"
cask "cheatsheet"
cask "chromium"
cask "cider"
cask "discord"
cask "docker"
cask "eclipse-java"
cask "element"
cask "elgato-control-center"
cask "elgato-game-capture-hd"
cask "elgato-stream-deck"
cask "emacs"
cask "emojipedia"
cask "epic-games"
cask "firefox"
cask "fl-studio"
cask "freecad"
cask "ghidra"
cask "gimp"
cask "gpg-suite"
cask "graphiql"
cask "iina"
cask "ilok-license-manager"
cask "inkscape"
cask "kicad"
cask "ltspice"
cask "macfuse"
cask "macs-fan-control"
cask "mcjack123/craftospc/craftos-pc"
cask "minecraft"
cask "monitorcontrol"
cask "multimc"
cask "mumble"
cask "musescore"
cask "native-access"
cask "obs"
cask "obsidian"
cask "openscad"
cask "orion"
cask "parallels"
cask "penc"
cask "pixelcmtd/extra/auto-tune-access"
cask "pixelcmtd/extra/dfx-geometer"
cask "rar"
cask "raspberry-pi-imager"
cask "scout"
cask "signal"
cask "softube-central"
cask "spotify"
cask "steam"
cask "surge-synthesizer"
cask "surge-xt"
cask "temurin"
cask "tetrio"
cask "thonny"
cask "thunderbird"
cask "tor-browser"
cask "unity-hub"
cask "utm"
cask "homebrew/cask-versions/wine-staging"
cask "vimr"
cask "vlc"
cask "vscodium"
cask "waterfox"
cask "wireshark"
cask "xonotic"
cask "xquartz"

mas "Apple Configurator", id: 1037126344
mas "WeTransfer", id: 1114922065
mas "GeoGebra Graphing Calculator", id: 1294018688
mas "Microsoft Remote Desktop", id: 1295203466
mas "Drafts", id: 1435957248
mas "Dark Reader for Safari", id: 1438243180
mas "iStatistica Pro", id: 1447778660
mas "Mastonaut", id: 1450757574
mas "Transporter", id: 1450874784
mas "Wayback Machine", id: 1472432422
mas "Yubico Authenticator", id: 1497506650
mas "Bluetooth Inspector", id: 1509085044
mas "JoyKeyMapper", id: 1511416593
mas "Boop", id: 1518425043
mas "Refined GitHub", id: 1519867270
mas "Displaperture", id: 1543920362
mas "Hush", id: 1544743900
mas "Color Picker", id: 1545870783
mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Final Cut Pro", id: 424389933
mas "Compressor", id: 424390742
mas "Disk Speed Test", id: 425264550
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
mas "Logic Pro", id: 634148309
mas "Simplenote", id: 692867256
mas "Microsoft OneNote", id: 784801555
mas "Shazam", id: 897118787
mas "TickTick", id: 966085870
